---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.Clear
source: html/45607fa7-4f35-1e7b-45af-75013fca87c7.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.Clear Method

Removes every model curve from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```